const eventsData = {
"-2000": [
    {
      id: 1,
      name: "Строительство пирамиды Хеопса",
      year: "-2000",
      citate: "«Человек боится Времени, а время боится Пирамид» — Арабская пословица",
      location: "Египет, Гиза",
      description: "По приказу фараона Хеопса архитектор Хемиун спроектировал усыпальницу, которая должна была превзойти все предыдущие. Строительство велось на скальном плато, которое служило естественным фундаментом.Рабочие были не рабами, а профессиональными каменщиками и сезонными крестьянами, которые трудились во время разлива Нила. Они жили в рабочем поселке, получали хлеб, пиво, лук и медицинскую помощь.",
      value: "Пирамида стала «местом воскрешения» — машиной для вознесения обожествленного фараона к звездам. Она воплощала идею «первозданного холма», из которого возник мир.Строительство стало мощнейшим стимулом для каменоломен, транспорта и сельского хозяйства. Однако истощение ресурсов страны было колоссальным, что косвенно привело к кризису V и VI династий.",
      outcome: "Пирамида стала «визитной карточкой» древнего Египта в веках. Арабы называли её вила Хеопса. Единственное из Семи чудес Древнего мира, сохранившееся до наших дней. Пирамида породила тысячи легенд. Она стимулировала развитие археологии. Пирамида — памятник эго фараона, утвердившего свою божественность ценой огромных ресурсов страны. Но для человечества это — бессмертный символ абсолютной воли и интеллекта, бросивших вызов самой гравитации и времени.Строительство пирамиды Хеопса стало кульминацией эпохи Древнего царства — техническим чудом, истощившим страну, но навеки вписавшим имя Египта в историю цивилизации.",
      coordinates: { x: 55, y: 47 },
      picture: "Пирамида Хеопса.jpg"
    }
  ],
  "-490": [
    {
      id: 2,
      name: "Битва при Марафоне",
      year: "-490",
      citate: "«Νενικήκαμεν!» «Мы победили!» или «Радуйтесь, мы победили!» - Неизвестный воин",
      location: "Греция, Марафон",
      description: "Персидская империя стремилась наказать Афины и Эретрию за помощь восставшим греческим городам Малой Азии. Дарий отправил флот и сухопутную армию под командованием Датиса и Артаферна. После разрушения Эретрии персы высадились на побережье Аттики, выбрав для этого Марафонскую равнину — удобное место для действий конницы.",
      value: "Если бы персы победили, дальнейшее развитие европейской цивилизации могло бы пойти по совсем иному пути — под восточным влиянием. Марафон сохранил независимость Афин, позволив им стать культурным и политическим центром классической Греции. Миф о бегуне: Легенда гласит, что афинский воин Фидиппид пробежал от Марафона до Афин (около 42 км), крикнул «Радуйтесь, мы победили!» и упал замертво. На основе этого мифа в 1896 году была учреждена марафонская дистанция в современных Олимпийских играх (хотя исторически Фидиппид бежал до Спарты за помощью, а не после битвы).",
      outcome: "Персидское войско было полностью разбито и эвакуировано морем. Попытка персов обойти Афины с юга и захватить город, пока армия была в Марафоне, провалилась — греки быстро вернулись и заняли оборону.Битва доказала превосходство тяжелой пехоты над разнородным персидским войском и возможность тактического маневра в фаланге.",
      coordinates: { x: 54, y: 40 },
      picture: "Битва при Марафоне.jpg"
    }
  ],
  "-44": [
    {
      id: 3,
      name: "Убийство Юлия Цезаря",
      year: "-44",
      citate: "«Καὶ σὺ, τέκνον» «И ты, Брут?» - Цитата самого Юлия Цезаря, когда увидел своих убийц",
      location: "Рим",
      description: "Юлий Цезарь был пожизненным диктатором. Группа заговорщиков, состоявшая из около 60 римских сенаторов во главе с Марком Юнием Брутом, решила физически устранить его, чтобы восстановить традиционную республику. Они опасались, что Цезарь окончательно уничтожит остатки республиканских институтов и провозгласит себя царем. В день убийства Цезарь, проигнорировав предупреждения, вошел в курию. Заговорщики окружили его, якобы с прошением за изгнанного брата одного из них. Подав сигнал, они нанесли ему множественные удары кинжалами.",
      value: "Заговорщики надеялись, что народ и армия встретят их как «тираноубийц» и вернут власть Сенату. Однако римское общество, уставшее от гражданских войн, не поддержало убийц. На похоронах Цезаря Марк Антоний своей знаменитой речью «Друзья, римляне, соотечественники!» разжег толпу, которая сожгла здание Сената и вынудила заговорщиков бежать из Рима.Вместо возрождения республики убийство ускорило ее гибель. Борьба наследников Цезаря привела к окончательной победе Октавиана над Антонием и Клеопатрой, что ознаменовало начало эпохи Римской империи.",
      outcome: "Событие стало классическим примером того, что устранение харизматического лидера без изменения общественных условий не восстанавливает старый порядок, а лишь ведет к хаосу и появлению еще более жесткой власти. Событие показало, что Рим нуждался в единоличном правителе. Именно страх перед участью Цезаря заставил Октавиана Августа создать систему «принципата» с сохранением внешних республиканских атрибутов, чтобы избежать участи диктатора.",
      coordinates: { x: 50, y: 39  },
      picture: "Смерть Цезаря.jpg"
    }
  ],
  "79": [
    {
      id: 4,
      name: "Извержение Везувия",
      year: "79",
      citate: "«В ничегоness уходит всё.» («IN NIHILO NIHIL OM[NIA]») - Надпись на стене в Помпее",
      location: "Италия, Помпеи",
      description: "В середине дня появилось огромный столб пепла и газов высотой до 30 км, которое поднялось выше тропопаузы. Ветер понес пепел на юго-восток — в сторону Помпей.Столб рухнул, породив гигантские потоки раскаленного газа, пепла и обломков. Температура внутри них достигала 500–800 °C, скорость — до 100 км/ч. Погибло около 16 000–20 000 человек. Среди жертв — писатель Плиний Старший, командовавший флотом и пытавшийся спасти людей.",
      value: "Гибель Помпей «законсервировала» римскую жизнь в первозданном виде. Благодаря раскопкам мы узнали об устройстве римских домов, фресках, надписях, еде, медицине и даже повседневных граффити. По сути, это «капсула времени» Римской империи I века.Катастрофа показала, как хрупка цивилизация перед силами природы. В то же время она продемонстрировала героизм и трагедию тех, кто остался.",
      outcome: "Города исчезли с карты на 1700 лет. Забыты даже их названия. Местные жители впоследствии верили, что там лежат «проклятые поля».Везувий изменил облик — его вершина обрушилась, образовав современный кратер. Вулкан «проснулся» и продолжает извергаться до сих пор, последнее сильное — в 1944 году. Помпеи и Геркуланум стали величайшим археологическим музеем под открытым небом. Находки повлияли на неоклассицизм в Европе, а фрески — на эстетику XVIII–XIX веков. Выражение «День Помпеи» стало метафорой внезапной катастрофы и застывшего времени.",
      coordinates: { x: 50, y: 32 },
      picture: "Извержение вулкана.jpg"
    }
  ],
  "1054": [
    {
      id: 4,
      name: "Разделение Католической и Православной церквей",
      year: "1054",
      citate: "«Пусть видит и судит Бог» - папские легаты во главе с кардиналом Гумбертом",
      location: "Италия, Помпеи",
      description: "На протяжении первого тысячелетия существовала Единая Вселенская Церковь. Однако между её западной частью, с центром в Риме, где главенствовал Папа и восточной накапливались культурные, богословские и политические различия. Римляне говорили на латыни, греки — на греческом. Запад пережил падение Римской империи, Византийская Империя продолжал существовать.Формально это был конфликт двух иерархов, но по факту произошло необратимое разделение. Попытки объединиться позже провалились: народ и священство на Востоке не приняли власть Папы.",
      value: "Западная Европа консолидировалась вокруг Папы как духовного лидера. Восточная Европа: Византия, Русь, Балканы связала себя с православием. Это определило разные пути развития: например, Кириллица (православие) против Латыни (католичество). Католицизм развил строгую юридическую логику, учение о заслугах святых, индульгенциях, верховной власти Папы и филиокве. Позже это привело к Реформации. Православие сохранило мистический, соборный подход, где император и патриарх действуют в симфонии, а догматы меняются только на Вселенских соборах, где голос простых священников и монахов важен. В 1453 году Константинополь пал под натиском турок-османов. Католическая Европа мало помогла. Православные стали видеть в Московском княжестве «Третий Рим» — последний оплот истинного христианства. Это укрепило самодержавие на Руси и её обособленность от «еретического» Запада.",
      outcome: "Мир христианства раскололся на две ветви: Римско-католическую церковь (Запад) и Православную церковь (Восток). Прекратилось евхаристическое общение: католики и православные больше не могли молиться вместе, причащаться из одной чаши или венчаться друг с другом. Папа Римский потерял власть над Востоком, а Константинопольский Патриарх — над Западом.",
      coordinates: { x: 50, y: 40 },
      picture: "Раскол Церкви.jpg"
    }
  ],
  "1066": [
    {
      id: 5,
      name: "Битва при Гастингсе",
      year: "1066",
      citate: "Он ещё жив!» или «Он ещё дышит!» - один из воинов короля Гарольда II Годвинсона",
      location: "Англия, Гастингс",
      description: "После смерти короля Эдуарда Исповедника в январе 1066 года, Гарольд II был коронован, но Вильгельм Нормандский заявил, что Эдуард обещал трон ему. Вильгельм собрал флот и высадился в Англии. Армия Гарольда была истощена: за две недели до Гастингса она разбила норвежского претендента Харальда Сурового при Стамфорд-Бридже и совершила марш-бросок на юг. Англосаксы заняли оборону на вершине холма, построив «стену щитов» — плотный строй тяжелой пехоты. Вильгельм атаковал рыцарской конницей и лучниками, но прорвать строй не удавалось.",
      value: "Битва при Гастингсе — ключевое сражение, после которого древняя англосаксонская знать была практически уничтожена или заменена нормандской.Битва показала превосходство комбинированной тактики над традиционным пешим строем англосаксов. В Англии утвердился классический феодальный способ ведения войны — рыцарская конница и замки. До 1066 года Англия была связана в основном со Скандинавией. После завоевания она оказалась в орбите французской политики и культуры, что позже привело к Столетней войне.",
      outcome: "Англия осталась без организованного сопротивления.Рождество 1066 года в Вестминстерском аббатстве.Последующие пять лет Вильгельм подавлял восстания англосаксов, которые получили название «Опустошение Севера». Битва при Гастингсе — одно из самых судьбоносных сражений в истории Европы. Оно привело к полной смене правящей элиты Англии, радикально изменило ее язык, культуру, государственное устройство и навсегда связало ее с континентом, заложив основы средневековой Англии.",
      coordinates: { x: 47, y: 33 },
      picture: "Битва при Гастинге.jpg"
    }
  ],
  "1453": [
    {
      id: 6,
      name: "Падение Константинополя",
      year: "1453",
      citate: "«Город пал, а я ещё жив.» (по-гречески: «ἡ Πόλις ἔπεσε, κ᾿ ἐγὼ ζῶ!») - православный священник из Конст[...]",
      location: "Византийская империя",
      description: "Османы не могли завести корабли в бухту Золотой Рог, так как вход был перегорожен гигантской цепью. Мехмед приказал перетащить флот по суше на катках в обход цепи – османские корабли оказались в бухте, и защитники потеряли контроль над водами.Гигантская пушка Урбана пробила стены Феодосия, но заряжалась 2 часа – за это время византийцы заделывали проломы.Мехмед бросил три волны войск. Командующий обороной генуэзец Джованни Джустиниани был смертельно ранен.",
      value: "Веками Константинополь был «щитом» Европы от исламских вторжений с востока. После падения города османы получили плацдарм для вторжения на Балканы. Европа лишилась восточного оплота христианства. Это также углубило раскол между католической и православной церквями. Путь в Индию и Китай, проходивший через Константинополь, теперь полностью контролировали турки. Европейские монархии оказались отрезанными от восточной торговли. Это заставило их искать морские пути в Азию. Тысячи греческих ученых, философов и художников бежали из разграбленного Константинополя в Европу. Они привезли с собой античные рукописи, которые столетиями хранились в Византии. Это дало мощный импульс итальянскому Возрождению и появлению университетов в Европе.",
      outcome: "Империя, просуществовавшая 1123 года, прекратила свое существование. Последний римский император пал в бою.Мехмед II сделал город столицей Османской империи. Собор Святой Софии был переделан в мечеть. Город активно заселялся мусульманами, хотя греческой общине разрешили жить.По обычаю того времени, войскам дали три дня на разграбление города. Было уничтожено множество античных статуй, книг, икон и реликвий. Десятки тысяч жителей были убиты или угнаны в рабство.",
      coordinates: { x: 55, y: 40 },
      picture: "Падение Константинополя.jpg"
    }
  ],
  "1492": [
    {
      id: 7,
      name: "Открытие Америки Колумбом",
      year: "1492",
      citate: "«¡Tierra! ¡Tierra!» «Земля! Земля!» - матрос Родриго де Триана, когда увидел Америку",
      location: "Америка",
      description: "3 августа 1492 года три корабля вышли из порта Палос. После долгого перехода через неизведанный океан и нарастающего бунта команды 12 октября 1492 года матрос Родриго де Триана увидел землю. Колумб назвал открытые территории «Индиями». До конца жизни он не признал, что открыл новый континент.",
      value: "Два прежде изолированных мира — Старый Свет (Евразия и Африка) и Новый Свет (Америка) — объединились. Начался «Колумбов обмен» — глобальное перемещение людей, растений, животных, технологий, болезней и культур.Испания стала доминирующей державой XVI века, создав колониальную систему. Её флот и армии контролировали моря.Истребление индейцев и потребность в рабочей силе на плантациях привели к массовому ввозу африканских рабов. Трансатлантическая работорговля продлилась более трёх с половиной веков.",
      outcome: "Папа Римский Александр VI в 1493 году издал буллы, а в 1494 году заключен Тордесильясский договор между Испанией и Португалией. Граница раздела прошла через Атлантику в 370 лигах к западу от Кабо-Верде: земли к западу отходили Испании, к востоку — Португалии, так Португалия получила будущую Бразилию. Испанские конкистадоры начали завоевание островов и материка, закладывая первые поселения. В течение нескольких десятилетий из-за войн, принудительного труда, голода и завезенных европейцами болезней население Эспаньолы сократилось с сотен тысяч до нескольких десятков тысяч человек.",
      coordinates: { x: 25, y: 40 },
      picture: "Открытие Америки Колумбом.jpg"
    }
  ],
  "1760": [
    {
      id: 8,
      name: "Промышленная революция",
      year: "1760",
      citate: "«Это была величайшая, самая быстрая и самая всеобъемлющая революция из всех пережитых человечеством - Фридрих Энгельс",
      location: "Великобритания",
      description: "Человечество веками производило товары вручную или с помощью силы воды/ветра. В конце XVIII века цепочка изобретений привела к созданию машинного производства, фабрик и заводов. Люди массово переезжали из деревень в города, а аграрная экономика сменилась индустриальной.",
      value: "Впервые за несколько тысяч лет основой экономики стала не мускульная сила, а машина и ископаемое топливо. Производительность труда выросла в десятки и сотни раз. Промышленность обеспечила Европу нарезным оружием, стальными кораблями, а затем и пулемётами. Это позволило западным странам в XIX веке практически беспрепятственно колонизировать Африку, Индию и Китай. Промышленная революция создала разрыв между индустриальным «Западом» и аграрным «миром остальных». Одновременно началось массовое загрязнение воздуха, воды и изменение ландшафта.",
      outcome: "Мануфактура уступила место фабрике с машинами, где десятки и сотни полуквалифицированных рабочих выполняют однотипные операции.Англия стала первой страной, где более 50% населения жило в городах. Манчестер, Ливерпуль, Бирмингем выросли в разы. Появились трущобы, антисанитария, но и начали формироваться системы канализации и уличного освещения.Стихийные бунты, затем профсоюзы, стачки и борьба за законодательное ограничение рабочего дня.",
      coordinates: { x: 46, y: 30 },
      picture: "Промышленная революция.jpg"
    }
  ],
  "1772": [
    {
      id: 9,
      name: "Первый раздел Речи Постполитой",
      year: "1772",
      citate: "«В первом разделе Польши... я увидел начало новой революционной морали в политике Европы. Я увидел, как соседние державы, не имея никакой ссоры с этой нацией, просто по взаимному согласию отрезали от нее кусок за куском, чтобы наградить себя и поддерживать равновесие» - Эдмунд Бёрк ",
      location: "Польша",
      description: "Летом 1772 года войска трех держав одновременно вторглись на территорию Польши и заняли оговоренные области. Под давлением оккупационных армий и дипломатов польский сейм был вынужден в 1773 году ратифицировать договор об уступке земель",
      value: "Раздел показал, что Речь Посполитая перестала быть субъектом международной политики и превратилась в объект торга соседей. Это был первый шаг к полной ликвидации государства. В Европе впервые была публично применена концепция «раздела ради баланса сил». Это вызвало шок у некоторых мыслителей, но в целом европейские державы отнеслись к разделу индифферентно",
      outcome: "Речь Посполитая потеряла около 30% своей территории и более 4-5 миллионов жителей. Первый раздел стал результатом глубокого внутреннего кризиса Речи Посполитой, усиленного внешним вмешательством и борьбой за власть между шляхетскими группировками. Он заложил основы для последующих разделов, которые окончательно ликвидировали независимость государства. ",
      coordinates: { x: 54, y: 33 },
      picture: "Первый раздел Польши.jpg"
    }
  ],
  "1776": [
    {
      id: 10,
      name: "Независимость США",
      year: "1776",
      citate: "«Мы считаем очевидными следующие истины: что все люди созданы равными, что они наделены их Творцом определенными неотъемлемыми правами, к числу которых относятся жизнь, свобода и стремление к счастью» - преамбула Декларации независимости США",
      location: "Северная Америка",
      description: "19 апреля 1775 года произошли сражения при Лексингтоне и Конкорде — «выстрел, который услышал весь мир», положивший начало военным действиям. В ходе Войны за независимость (1775–1783) Второй Континентальный конгресс 4 июля 1776 года принял Декларацию независимости, главным автором которой стал Томас Джефферсон. Этот документ провозглашал отделение 13 колоний от британской короны и создание США.",
      value: "Создание первой крупной республики в Новом времени: В отличие от европейских абсолютных монархий, США стали первым государством, основанном на принципах народного суверенитета и естественных прав человека .Американская революция вдохновила Великую французскую революцию и в дальнейшем — движения за независимость в Латинской Америке и других регионах мира. Как указано в Декларации, уважение к мнению человечества требовало объяснения причин, побудивших к отделению .",
      outcome: "3 сентября 1783 года Великобритания официально признала Соединенные Штаты Америки «свободными, суверенными и независимыми государствами» .За США были закреплены территории от Атлантического океана до реки Миссисипи и от Великих озер до испанской Флориды Вместо монархии была установлена республиканская форма правления, позже закрепленная принятием Конституции США и Билля о правах.",
      coordinates: { x: 26, y: 40 },
      picture: "Декларация независимости США.jpg"
    }
  ],
  "1789": [
    {
      id: 11,
      name: "Французская революция",
      year: "1789",
      citate: "«Свобода, равенство, братство!» - Максимилиан Робеспьер",
      location: "Франция",
      description: "5 мая 1789 года король Людовик XVI созвал Генеральные штаты, чтобы утвердить новые налоги. Депутаты третьего сословия, ущемлённые в правах, 17 июня провозгласили себя Национальным собранием, а 9 июля — Учредительным собранием, взяв на себя задачу выработки конституции .",
      value: "Французская революция нанесла удар по феодализму во всей Европе, способствовала распространению идей демократии, национального суверенитета и прав человека. Революция стала моделью для всех последующих революционных движений в Европе и мире.",
      outcome: "Франция из монархии стала республикой. Дворянство и духовенство лишились своих сословных преимуществ. Были отменены десятины, сеньоральные суды, личные феодальные повинности крестьян .",
      coordinates: { x: 48, y: 35 },
      picture: "Французская революция.jpg"
    }
  ],
  "1793": [
    {
      id: 12,
      name: "Второй раздел Речи Посполитой",
      year: "1793",
      citate: "«Хватит! Речь Посполитая гибнет! Раздирают её соседи!.. Бегите, бегите, поляки, на конях и на колесни[...]",
      location: "Польша",
      description: "Русские войска вошли в Польшу, началась русско-польская война 1792 года. Польская армия, несмотря на героическое сопротивление, была разбита, а король Станислав Август Понятовский под давлением России перешел на сторону конфедератов, фактически предав Конституцию 3 мая .",
      value: "Если Первый раздел был урезанием территорий, то Второй раздел сделал Речь Посполитую нежизнеспособной. Государство потеряло независимость, превратившись в марионеточный буфер, полностью зависимый от России .Второй раздел укрепил позиции Пруссии и России (за счет воссоединения исконно русских земель). Однако раздел отвлек силы Пруссии и Австрии от войны с революционной Францией, что способствовало успехам Наполеона в первые годы революционных войн .",
      outcome: "Общая площадь потерянных территорий составила около 307 000 км². Государство сократилось до размеров 215 000 км², потеряв более половины своей территории и населения (с 5 до 4 миллионов человек) .Оставшаяся территория Речи Посполитой фактически превращалась в протекторат России. Все реформы были аннулированы, восстановлена старая шляхетская «вольность» в её наиболее хаотичной форме.",
      coordinates: { x: 53, y: 32 },
      picture: "Второй раздел Польши.jpg"
    }
  ],
  "1795": [
    {
      id: 13,
      name: "Третий раздел Речи Посполитой",
      year: "«Finis Poloniae!» «Конец Польши!» - умирающий воин Тадеуш Костюшко",
      citate: "«Finis Poloniae!» «Конец Польши!» - умирающий воин Тадеуш Костюшко",
      location: "Польша",
      description: "Изначально Екатерина II колебалась, стоит ли окончательно ликвидировать польскую государственность, однако Пруссия и Австрия настаивали на полном разделе. 24 октября 1795 года державы подписали соглашение о Третьем разделе. 25 ноября 1795 года последний король Речи Посполитой Станислав II Август Понятовский подписал в Гродно акт отречения от престола. Государство Речь Посполитая исчезло с карты Европы .",
      value: "Для России это был не столько захват чужой земли, сколько возвращение древнерусских территорий, входивших в состав Киевской Руси, которые были утеряны в период феодальной раздробленности и нашествий. Екатерина II рассматривала это как воссоединение .Польское государство исчезло с карты на 123 года — оно было восстановлено только в 1918 году после Первой мировой войны .",
      outcome: "Речь Посполитая полностью прекратила свое существование как независимое политическое образование. На карту Европы было наложено вето на само название «Польша» .В 1797 году Россия, Пруссия и Австрия подписали Петербургскую конвенцию, по которой обязались не включать в свои официальные титулы слова «Королевство Польское» и никогда не восстанавливать польское государство.",
      coordinates: { x: 53, y: 32 },
      picture: "Третий раздел Польши.jpg"
    }
  ],
  "1812": [
    {
      id: 14,
      name: "Отечественная война 1812 года",
      year: "1812",
      citate: "«Из всех моих сражений самое ужасное то, которое я дал под Москвой. Французы в нём показали себя достойными одержать победу, а русские... русские стяжали право быть непобедимыми» - Наполеон Банапарт",
      location: "Россия",
      description: "24 июня 1812 года «непобедимая» армия Наполеона перешла реку Неман и вторглась на территорию России . Русские армии с боями отступали, избегая генерального сражения. Главнокомандующим был назначен М.И. Кутузов. 7 сентября произошло Бородинское сражение — кровопролитнейшая битва, после которой русская армия отошла, но сохранила боеспособность. 14 сентября Наполеон вошёл в Москву, но город уже был покинут жителями и вскоре охвачен пожаром .",
      value: "Война объединила все сословия — от дворян до крестьян — в едином патриотическом порыве. Как писал историк М.И. Богданович, «вся Россия подобилась огромному военному стану; … все стремились принять какое бы то ни было участие в священном деле освобождения родины» .Победа над Наполеоном определила судьбу всей Европы и привела к созданию Венской системы международных отношений .События 1812 года вдохновили А.С. Пушкина, Л.Н. Толстого, П.И. Чайковского. В Москве в благодарность за спасение России был воздвигнут Храм Христа Спасителя .",
      outcome: "Из более чем 600 тыс. человек обратно перешли Неман лишь около 30 тыс. Начало Заграничных походов русской армии (1813-1814 гг.) и последующий разгром Наполеона в Европе. Вступление русских войск в Париж (31 марта 1814 г.) и отречение Наполеона от престола.",
      coordinates: { x: 57, y: 31 },
      picture: "Разгром Наполеона в России.jpg"
    }
  ],
  "1861": [
    {
      id: 15,
      name: "Гражданская война в США",
      year: "1861",
      citate: "«Мы благородно спасем или подло потеряем последнюю лучшую надежду на Земле» - Авраам Линкольн",
      location: "США",
      description: "Главной причиной конфликта было противостояние двух социально-экономических систем — капиталистического свободного труда на Севере и рабовладельческого хозяйства на Юге . Как отмечал Карл Маркс, «эта борьба вспыхнула потому, что обе системы не могут долее мирно существовать бок о бок на североамериканском континенте» .Непосредственный повод: Победа кандидата от республиканцев Авраама Линкольна на президентских выборах 6 ноября 1860 года.",
      value: "Карл Маркс в 1862 году писал, что «происходящие там (в США) события имеют всемирное значение» . Владимир Ленин подчеркивал «величайшее, всемирно-историческое, прогрессивное и революционное значение гражданской войны 1863–1865 годов в Америке» .Гражданская война в США была своеобразной формой буржуазно-демократической революции . Были решены важнейшие задачи: уничтожение рабства, восстановление Союза, передача власти буржуазии, демократическое решение земельного вопроса .",
      outcome: "Сепаратизм южных штатов был подавлен, страна сохранила единство .Были освобождены около 3,5 миллионов негров-рабов . В 1865 году была принята 13-я поправка к Конституции США, навсегда запретившая рабство.За четыре года войны погибло около 650 тысяч американцев — больше, чем во всех остальных войнах США, вместе взятых.",
      coordinates: { x: 24, y: 45 },
      picture: "Американская гражданская война.jpg"
    }
  ],
  "1866": [
    {
      id: 16,
      name: "Австро-Прусская война",
      year: "1866",
      citate: "…я исходил из того, что единая Германия — лишь вопрос времени и что Северогерманский союз только первый этап на пути к его разрешению» - Отто Фон Бисмарк",
      location: "Германия",
      description: "После победы над Данией в 1864 году Шлезвиг и Гольштейн перешли под совместное управление Пруссии и Австрии, что создало постоянный источник напряжённости. Отто фон Бисмарк, стремившийся к установлению прусской гегемонии в Германии, сознательно провоцировал конфликт.",
      value: "Пражский мир фактически уничтожил систему международных отношений, установленную Венским конгрессом 1815 года. Баланс сил в Центральной Европе, державшийся на дуополии Австрии и Пруссии, был окончательно нарушен в пользу Пруссии .Поражение обнажило внутреннюю слабость многонациональной Австрийской империи и привело к её трансформации в Австро-Венгрию. Это был компромисс, который дал венграм равные права с австрийцами, но одновременно усилил напряжённость среди других славянских народов империи .",
      outcome: "Германский союз, существовавший с 1815 года под председательством Австрии, был распущен .Под руководством Пруссии был образован Северогерманский союз — новое федеративное государство, объединившее германские государства к северу от реки Майн .Австрия была полностью отстранена от участия в германской политике и признала роспуск Германского союза .",
      coordinates: { x: 51, y: 35 },
      picture: "Прусско-Австрийская война.jpg"
    }
  ],
  "1904": [
    {
      id: 17,
      name: "Русско-Японская война",
      year: "1904",
      citate: " Война была вызвана, конечно, не Японией, война всем была непонятна своею ненужностью... Из-за чего эта война? Никто не знал - Викентий Вересаев и военный врач",
      location: "Китай, Маньчжурия",
      description: "В ночь с 8 на 9 февраля 1904 года японский флот внезапно атаковал русскую эскадру, стоявшую на внешнем рейде Порт-Артура, выведя из строя два броненосца и один крейсер . Одновременно японская эскадра блокировала в корейском порту Чемульпо крейсер «Варяг» и канонерскую лодку «Кореец», которые после неравного боя были затоплены и взорваны .",
      value: "Впервые в новой истории азиатская страна разгромила крупную европейскую империю. Это кардинально изменило представления о соотношении сил в мире и подняло международный статус Японии .Победа укрепила экспансионистские амбиции Японии, усилила влияние милитаристских кругов и поставила страну в один ряд с великими европейскими державами .",
      outcome: "Россия уступала Японии южную половину острова Сахалин (до 50-й параллели) .Южно-Маньчжурская железная дорога (до станции Куанченцзы) отходила к Японии. Россия признавала японский протекторат над Кореей Благодаря дипломатии С.Ю. Витте Россия не выплачивала Японии военных контрибуций .",
      coordinates: { x: 83, y: 36 },
      picture: "Русско Японская война.jpg"
    }
  ],
  "1914": [
    {
      id: 17,
      name: "Начало Первой мировой войны",
      year: "1914",
      citate: "«Огни гаснут по всей Европе. В нашей жизни мы уже не увидим их зажжёнными вновь» - министр иностранных дел Британии сэр Эдвард Грей",
      location: "Сербия",
      description: "К началу XX века в Европе накопился клубок неразрешимых противоречий: борьба за передел колоний, экономическое соперничество, территориальные претензии Франции и имперские амбиции России на Балканах.28 июня 1914 года в Сараево сербский националист Гаврило Принцип застрелил наследника австро-венгерского престола эрцгерцога Франца Фердинанда и его жену.",
      value: "Начало войны ознаменовало собой крушение европейского миропорядка, основанного на гегемонии аристократии, либеральных ценностях XIX века и вере в технический прогресс. Человечество вошло в длинный тоннель, залитый кровью и мраком. Жесткие условия Версальского мира породили мощное движение реваншизма и привели к власти в Германии нацистов, что напрямую спровоцировало начало Второй мировой войны.",
      outcome: "В результате войны прекратили своё существование Российская, Германская, Австро-Венгерская и Османская империи.Это одна из самых кровопролитных войн в истории. По разным оценкам, погибло от 8,5 до 10 миллионов военных и около 6,6–13 миллионов мирных жителей.Война привела к революциям в ряде стран, включая Февральскую и Октябрьскую революции в России, Ноябрьскую революцию в Германии. Соединённые Штаты, вступившие в войну в 1917 году, превратились из должника в мирового кредитора и доминирующую экономическую силу.",
      coordinates: { x: 52, y: 36 },
      picture: "Первая мировая война.jpg"
    }
  ],
  "1917": [
    {
      id: 18,
      name: "Февральская революция",
      year: "1917",
      citate: "«…совершается нечто большее, чем свержение старого строя, большее, чем революция, — в этот день наступал новый век. И мы первые вошли в него». — Алексей Толстой, писатель (из газеты Русские ведомости) .",
      location: "Россия",
      description: "Февральская революция стала первым этапом Великой российской революции 1917 года. В советской историографии она получила название Февральская буржуазно-демократическая революция . На Западе также используется наименование Мартовская революция.",
      value: "В результате Февральской революции в России пала одна из старейших и наиболее консервативных монархий в Европе. На смену абсолютной власти императора пришла республиканская форма правления с широкими демократическими свободами, что стало огромным шагом вперед по пути модернизации страны. Падение Российской империи и последовавшая за этим череда революций кардинально изменили геополитический ландшафт мира. Россия вышла из Первой мировой войны, что повлияло на её ход и итоги. А возникновение первого в мире социалистического государства (СССР) задало вектор развития всему XX веку, породив глобальное противостояние двух систем — капиталистической и коммунистической .",
      outcome: "Россия перестала быть империей и стала самой демократичной республикой в Европе на тот момент, согласно ряду западных и российских оценок. Была объявлена широкая политическая амнистия, отменена смертная казнь, провозглашены демократические свободы, ликвидированы сословные, национальные и религиозные ограничения. Полиция была заменена народной милицией .",
      coordinates: { x: 58, y: 30 },
      picture: "Февральская революция.jpg"
    },
    {
      id: 19,
      name: "Октябрьская революция",
      year: "1917",
      citate: "«Наш рабочий класс ещё далеко не может с пользой для себя и для страны взять в свои руки всю полноту политической власти. Навязать ему такую власть — значит толкать его на путь величайшего исторического несчастья» - теоретик марксизма Г.В. Плеханов ",
      location: "Россия",
      description: "Февральская революция 1917 года свергла монархию, однако Временное правительство не смогло решить ключевые проблемы страны. Лозунги большевиков — «Мир — народам!», «Земля — крестьянам!», «Фабрики — рабочим!», «Вся власть Советам!» — находили всё большую поддержку в массах .",
      value: "Была ликвидирована система эксплуатации человека человеком, отменены сословия, провозглашено равноправие народов и право наций на самоопределение . Впервые в истории были законодательно закреплены право на труд, бесплатное образование и медицинское обслуживание, 8-часовой рабочий день .В результате революции от бывшей империи отделились Польша, Финляндия, страны Прибалтики. Для Беларуси Октябрьская революция открыла путь к созданию собственной государственности — Белорусской ССР .",
      outcome: "Вся полнота государственной власти перешла к Советам рабочих, солдатских и крестьянских депутатов во главе с партией большевиков . Декрет о мире и Декрет о земле стали программными документами нового государства, обеспечившими ему поддержку миллионов солдат и крестьян .На месте Российской империи было создано первое в мире социалистическое государство — Российская Советская Федеративная Социалистическая Республика, которая в 1922 году объединилась с другими советскими республиками в Союз Советских Социалистических Республик.",
      coordinates: { x: 55, y: 26 },
      picture: "Октябрьская революция.jpg"
    }
  ],
  "1918": [
    {
      id: 20,
      name: "Расстрел Царской семьи",
      year: "1918",
      citate: "«Говоря о том, что случилось с Романовыми, люди даже сегодня настойчиво называют это казнью. Но это не была казнь... То, что произошло в подвале... было просто-напросто омерзительным, безумным и топорно исполненным хладнокровным убийством. Виновны те, кто совершал это злодеяние, и те, кто десятилетиями оправдывал его.» - Хелен Раппапорт, британский историк, из книги «Рок семьи Романовых»",
      location: "Россия, Екатеринбург",
      description: "В ночь на 17 июля 1918 года комендант дома Яков Юровский разбудил царскую семью и под предлогом угрозы расстрела со стороны приближающихся белых войск приказал им спуститься в полуподвальную комнату . Когда семья собралась, Юровский зачитал постановление Уральского областного Совета о расстреле. По свидетельствам, он произнес: «Николай Александрович, ваши родственники пытаются вас спасти, но это им не удалось, и мы вынуждены расстрелять вас самих» .",
      value: "Гибель беззащитной семьи, включая детей и слуг, не причастных к политике, по мнению историков, породила глубокую коллективную травму в российском обществе. Это было не судебное разбирательство или политическая казнь, а, по определению современного историка Хелен Раппапорт, «омерзительное, безумное и топорно исполненное хладнокровное убийство» . Долгое время об этом молчали, а истина замалчивалась, что не позволило обществу провести полноценную рефлексию и «переварить» эту трагедию .",
      outcome: "Николай II, его жена и дети были убиты. Это положило конец 304-летнему правлению династии Романовых в России. В 2000 году Русская Православная Церковь причислила Николая II и членов его семьи к лику святых как страстотерпцев .17 июля 1998 года, в 80-ю годовщину расстрела, останки Николая II, Александры Федоровны и трех их дочерей были захоронены в родовой усыпальнице Романовых — Петропавловском соборе Санкт-Петербурга. Церемония носила государственный характер .",
      coordinates: { x: 62, y: 29 },
      picture: "Расстрел семьи Романовых.jpg"
    }
  ],
  "1933": [
    {
      id: 21,
      name: "Приход в Германии к власти Адольфа Гитлера",
      year: "1933",
      citate: "«Когда нацисты пришли за коммунистами, я молчал, я ведь не был коммунистом. Потом они пришли за социал-демократами, я молчал, я ведь не был социал-демократом. Потом они пришли за профсоюзными деятелями, а я не был членом профсоюза. Потом они пришли за евреями, я молчал, я ведь не был евреем. А когда они пришли за мной, уже некому было заступиться» - немецкий пастор и богослов Мартин Нимёллер",
      location: "Германия",
      description: "30 января 1933 года после продолжительных интриг и давления со стороны своего окружения 86-летний президент Гинденбург, который лично недолюбливал «богемского ефрейтора», всё же поддался уговорам. Гитлер был приведен к присяге в качестве рейхсканцлера.",
      value: "Первая демократия в истории Германии пала под натиском внутреннего кризиса и экстремизма. Парламентская система была заменена тоталитарным режимом, основанным на принципе «фюрерства» (единовластия).Это событие остается главным историческим уроком о том, к чему приводит слабость демократических институтов, социальная незащищенность населения и популизм. Даже легальный приход к власти радикальной партии может уничтожить саму демократию.",
      outcome: "Сразу после назначения Гитлер добился роспуска парламента и назначения новых выборов. За неделю до выборов произошел поджог рейхстага, который нацисты использовали как предлог. На следующий день был подписан указ «О защите народа и государства», отменявший базовые гражданские права (свободу слова, собраний, тайну переписки).После смерти президента Гинденбурга Гитлер объединил должности канцлера и президента, став «Фюрером и рейхсканцлером». Армия присягнула лично Гитлеру. Диктатура была оформлена окончательно.",
      coordinates: { x: 50, y: 33 },
      picture: "Приход Гитлера к власти.jpg"
    }
  ],
  "1939": [
    {
      id: 22,
      name: "Начало Второй мировой войны",
      year: "1939",
      citate: "«Трагедия Германии заключалась в том, что критическая масса немецкого населения, жаждущая порядка и уважения к себе, с удовольствием последовала за самым безрассудным преступником в истории человечества» - Энтони Бивор Британский историк",
      location: "Польша",
      description: "Дату 1 сентября 1939 года Гитлер выбрал не случайно — именно в этот день 129 лет назад Наполеон начал свое злополучное вторжение в Россию. Это был символический жест, призванный подчеркнуть претензии Германии на мировое господство. Ещё в апреле 1939 года был разработан стратегический план «Вайс», который предполагал нападение на Польшу без объявления войны.",
      value: "1 сентября 1939 года — это точка отсчёта самого кровавого конфликта в истории человечества. Война продолжалась ровно 2194 дня. Каждый час в среднем погибала тысяча человек . К моменту окончания войны в 1945 году общие потери составили, по разным оценкам, от 70 до 85 миллионов человек .Вторая мировая война стала тотальной войной, в которой жертвами впервые в таком масштабе стало мирное население. Бомбардировки городов, концентрационные лагеря, массовые казни, голод и эпидемии унесли больше жизней, чем боевые действия на фронтах .",
      outcome: "Территория Польши была разделена между Германией и СССР. К Германии отошли западные и центральные воеводства, а также вольный город Данциг (Гданьск). СССР аннексировал восточные территории — Западную Украину и Западную Белоруссию .В последующие месяцы Германия продолжила агрессию: в апреле 1940 года были захвачены Дания и Норвегия, в мае — Бельгия, Нидерланды, Люксембург и Франция. Война стремительно охватывала всё новые территории .",
      coordinates: { x: 53, y: 32 },
      picture: "Вторая мировая война.jpg"
    }
  ],
  "1940": [
    {
      id: 23,
      name: "Четвёртый раздел Польши",
      year: "1940",
      citate: "«Достаточно одного удара, и польское государство, это уродливое детище Версаля, рухнет… Нам нужна не война с Западом, а совместная с русскими акция против польского государства» - Адольф Гитлер",
      location: "Польша",
      description: "Однако в исторической памяти и современной публицистике «Четвёртым разделом Польши» чаще всего называют события 1939 года, когда Польша была вновь уничтожена в результате тайного сговора двух тоталитарных режимов — гитлеровской Германии и сталинского СССР.",
      value: "Пакт Молотова-Риббентропа и последовавший за ним раздел Польши уничтожили систему международных отношений, установленную после Первой мировой войны. Он показал неспособность Лиги Наций и западных демократий (Великобритании и Франции, формально объявивших войну Германии) предотвратить агрессию и защитить суверенитет малой страны. Для Польши 17 сентября 1939 года стало «ударом в спину» и символом предательства со стороны партнера (СССР), с которым был подписан договор о ненападении . Это событие остаётся одной из самых болезненных точек в польско-российских отношениях и трагическим символом утраченной государственности.",
      outcome: "Польша, восстановленная после Первой мировой войны, перестала существовать как суверенное государство уже через пять недель после начала войны .Польское правительство (президент, часть парламента и верховное командование) эвакуировалось через Румынию во Францию, а затем в Лондон, продолжая борьбу против Германии на стороне союзников. На оккупированных территориях развернулось мощное движение Сопротивления.",
      coordinates: { x: 53, y: 32 },
      picture: "Четвертый раздел Польши.jpg"
    }
  ],
  "1945": [
    {
      id: 24,
      name: "Победа в Великой Отечественной войне",
      year: "1945",
      citate: "«Никто не забыт, ничто не забыто» - советская поэтесса Ольга Фёдоровна Берггольц",
      location: "Берлин",
      description: "В ночь с 8 на 9 мая 1945 года в пригороде Берлина Карлсхорсте был подписан Акт о безоговорочной капитуляции Германии. С советской стороны документ подписал Маршал Советского Союза Георгий Константинович Жуков, с немецкой — генерал-фельдмаршал Вильгельм Кейтель.",
      value: "Победа превратила Советский Союз в одну из двух мировых сверхдержав. СССР участвовал в создании послевоенного миропорядка, а его авторитет в мире достиг колоссальных высот .Вопреки расчетам Гитлера на межнациональные разногласия, война сплотила многонациональный народ СССР. Все население страны — от фронтовиков до тружеников тыла — встало на защиту Родины. Этот беспримерный героизм и самопожертвование стали главным источником Победы .",
      outcome: "Фашистская Германия, создавшая мощную армию смерти и поработившая почти всю Европу, была поставлена на колени и признала себя побеждённой . Война в Европе завершилась.ена Победы оказалась трагически высока. СССР потерял 27 миллионов советских граждан. Было полностью или частично разрушено 1710 городов и посёлков и более 70 тысяч сёл и деревень .",
      coordinates: { x: 50, y: 33 },
      picture: "9 мая.jpg"
    },
    {
      id: 25,
      name: "Встреча на Эльбе",
      year: "1945",
      citate: "«Тяжелая солдатская дорога свела их с двух концов Европы к этой реке. Они по достоинству могут оценить усилия друг друга... В каких бы чинах и званиях ни были люди, соединившиеся сегодня на этом берегу Эльбы, — они прежде всего солдаты, и их рукопожатие это именно солдатское рукопожатие» - корреспондент Константин Симонов",
      location: "Берлин",
      description: "25 апреля около 13:30 по местному времени в районе города Штрела (недалеко от Торгау) произошла первая встреча: разведгруппа 69-й американской пехотной дивизии под командованием лейтенанта Альберта Котцебу встретилась с бойцами 175-го гвардейского стрелкового полка старшего лейтенанта Григория Голобородько .",
      value: "Встреча на Эльбе стала высшей точкой союзнических отношений между СССР, США и Великобританией в борьбе против общего врага — нацизма . Она наглядно продемонстрировала, что, несмотря на идеологические различия, страны могут объединиться перед лицом общей угрозы. Это единство вошло в историю как «Дух Эльбы» .Событие имело огромное дипломатическое значение. Оно положило конец попыткам нацистского руководства стравить союзников и заключить сепаратный мир на Западе . Встреча показала, что СССР и западные демократии способны координировать свои действия.",
      outcome: "Встреча на Эльбе символизировала, что между союзниками больше нет сил противника. Как писал корреспондент Константин Симонов, «между нами и войсками союзников, просто говоря, нет немцев — они или убиты или взяты в плен» .Москва салютовала встрече на Эльбе 24 залпами из 324 орудий. Аналогичные торжества прошли на Таймс-сквер в Нью-Йорке . В последующие дни состоялись официальные встречи командующих — маршала Конева и генерала Брэдли, в ходе которых они обменялись подарками: Конев подарил американскому генералу боевого коня, а Брэдли — армейский джип «Виллис» .",
      coordinates: { x: 49, y: 35 },
      picture: "Встреча на Эльбе.jpg"
    },
    {
      id: 26,
      name: "Создание ООН",
      year: "1945",
      citate: "«Организация Объединенных Наций была создана не для того, чтобы вознести человечество в рай, но чтобы спасти его от ада» - второй Генеральный секретарь Организации Даг Хаммаршёльд ",
      location: "Вашингтон",
      description: "С 25 апреля по 26 июня 1945 года в Сан-Франциско проходила конференция, на которой представители 50 государств разработали и подписали Устав ООН. Польша, не присутствовавшая на конференции, подписала его позже и вошла в число 51 государства-основателя . Устав вступил в силу 24 октября 1945 года после его ратификации большинством подписавших стран — именно эта дата отмечается как официальный день рождения ООН .",
      value: "ООН стала символом и инструментом послевоенного мироустройства. Организация помогла восстановить страны после Второй мировой войны, поддержала обретение независимости бывшими колониями, способствовала развитию международного права . Как отмечается в исторических документах, «с основанием Организации Объединенных Наций был задан курс на верховенство права среди наций» .Создание ООН стало ответом на ужасы Второй мировой войны и Холокоста — стремлением создать механизмы, которые сделали бы повторение глобальной катастрофы невозможным. В 2025 году, отмечая 80-летие Организации, Генеральный секретарь ООН Антониу Гутерриш подчеркнул, что «Устав ООН — это не опция. Это краеугольный камень международных отношений» .",
      outcome: "ООН стала первой в истории международной организацией, объединившей практически все государства мира. На сегодняшний день в нее входят 193 страны-члена . Организация имеет систему ключевых органов: Генеральную Ассамблею, Совет Безопасности (несущий главную ответственность за поддержание мира), Экономический и Социальный Совет (ЭКОСОС), Международный Суд и Секретариат .Устав ООН закрепил фундаментальные принципы современных международных отношений: суверенное равенство государств, запрещение применения силы или угрозы силой, мирное урегулирование споров, невмешательство во внутренние дела.",
      coordinates: { x: 26, y: 40 },
      picture: "Создание ООН.jpg"
    },
    {
      id: 25,
      name: "Победа во Второй Мировой Войне",
      year: "1945",
      citate: "«Искренне надеюсь и, надеюсь, всё человечество надеется на то, что из этой торжественной церемонии возникнет лучший мир, выкованный из крови и страданий прошлого, — мир, основанный на вере и взаимопонимании, на человеческом достоинстве и свободе» - Генерал Дуглас Макартур ",
      location: "Берлин",
      description: "9 августа началась Маньчжурская стратегическая операция — стремительное наступление советских войск против Квантунской армии. 14 августа 1945 года император Хирохито принял условия Потсдамской декларации и впервые в истории обратился к народу с сообщением о капитуляции .",
      value: "Война подорвала могущество старых европейских империй. В Азии и на Тихом океане национально-освободительные движения, окрепшие в годы японской оккупации, после войны развернули борьбу за независимость. Победа над общим врагом не привела к долгому миру. Раскол мира на две противостоящие системы привёл к началу Холодной войны, гонке вооружений и разделению Европы и Азии на сферы влияния.",
      outcome: "СССР вернул Южный Сахалин, утраченный в 1905 году, и получил Курильские острова. Была обеспечена безопасность восточных границ Советского Союза .По аналогии с Нюрнбергским процессом в Германии, над японскими военными преступниками состоялся Международный военный трибунал для Дальнего Востока, осудивший руководителей Японии за преступления против мира и человечности.",
      coordinates: { x: 84, y: 45 },
      picture: "Победа во ВМВ.jpg"
    }
  ],
  "1950": [
    {
      id: 27,
      name: "Корейская война",
      year: "1950",
      citate: "«Корейская война стала шоком для американцев... Война закончилась вничью, что было для американцев почти так же невыносимо, как и поражение» - американский историк Дэвид Халберстам",
      location: "Корейский полуостров",
      description: "Утром 25 июня 1950 года армия КНДР при поддержке СССР и Китая перешла 38-ю параллель и начала наступление на Юг . Совет Безопасности ООН, воспользовавшись отсутствием представителя СССР, принял резолюцию об оказании военной помощи Южной Корее. Так началась война, в которой противоборствующие стороны выступали от имени мировых идеологических систем .",
      value: "Война подтвердила для Запада теорию «домино» и привела к резкому наращиванию военных расходов США в 4 раза. Она укрепила США на глобальное сдерживание коммунизма военными средствами. Был создан военный блок СЕАТО по образцу НАТО. Поскольку был подписан только акт о перемирии, а не мирный договор, Корейский полуостров остаётся одной из самых опасных точек мира. Любое обострение отношений может перерасти в новую «горячую» фазу конфликта с потенциальным применением современного оружия, включая ядерное .",
      outcome: "Главным политическим итогом стало сохранение разделения полуострова по 38-й параллели с созданием демилитаризованной зоны (ДМЗ). Задача объединения страны, которую ставили перед собой обе стороны, выполнена не была .Соглашение о перемирии подписали КНДР, Китай и силы ООН, но отказалась подписывать Южная Корея . До сих пор между двумя корейскими государствами сохраняется состояние военно-политического противостояния.",
      coordinates: { x: 82, y: 42 },
      picture: "Корейская война.jpg"
    }
  ],
  "1955": [
    {
      id: 28,
      name: "Вьетнамская война",
      year: "1955",
      citate: "«Мы, те, кто в администрациях Кеннеди и Джонсона участвовал в решениях по Вьетнаму… действовали в соответствии с тем, что считали принципами и традициями этой нации. Мы принимали наши решения в свете этих ценностей. И всё же мы ошибались. Я считаю, что мы ошибались ужасно… Я считаю, поэтому мы обязаны объяснить будущим поколениям, почему.» - министр обороны США Робертом Макнамарой",
      location: "Вьетнам",
      description: "США и созданное ими в 1955 году Государство Вьетнам на юге во главе с Нго Динь Зьемом отказались подписывать Женевские соглашения и не признали их обязательную силу . Зьем, при активной поддержке США, сорвал проведение выборов, понимая, что Хо Ши Мин, пользовавшийся огромной популярностью, уверенно бы их выиграл . США начали наращивать военную помощь Южному Вьетнаму, и к середине 1960-х годов конфликт перерос в войну с прямым участием американских войск.",
      value: "Война стала самым крупным военным и политическим поражением США во второй половине XX века . Она продемонстрировала пределы могущества сверхдержавы: имея подавляющее технологическое и военное превосходство, США не смогли победить асимметричную войну против решительного противника, пользующегося поддержкой населения и готового нести огромные потери .ойна спровоцировала мощнейшее антивоенное движение в США, которое раскололо общество на «ястребов» (сторонников войны) и «голубей» (противников). Массовые протесты, сожжение повесток и трагедия в Кентском университете (1970 год) стали символами эпохи .",
      outcome: "2 июля 1976 года Северный и Южный Вьетнам были официально объединены в единое государство — Социалистическую Республику Вьетнам со столицей в Ханое . Сайгон был переименован в Хошимин.В последующие годы сотни тысяч южновьетнамцев, сотрудничавших с США, а также этнических китайцев, пытались бежать из страны на утлых судах, что привело к гуманитарной катастрофе.США ввели всеобъемлющее торговое эмбарго против объединенного Вьетнама, которое продлилось почти 20 лет (до 1994 года), что усугубило экономические трудности страны .",
      coordinates: { x: 77, y: 57 },
      picture: "Вьетнамская война.jpg"
    }
  ],
  "1961": [
    {
      id: 29,
      name: "Полёт Гагарина в космос",
      year: "1961",
      citate: "«Гагарин показал, на что способен человек, — на самое большое. Он открыл людям Земли дорогу в неизведанный мир. Но только ли это? Думается, Гагарин сделал нечто большее — он дал людям веру в их собственные силы, в их возможности, дал стимул идти увереннее, смелее… Это — Прометеево деяние» - Главный конструктор Сергей Павлович Королев",
      location: "Байконур",
      description: "12 апреля 1961 года в 09:07 по московскому времени с космодрома Байконур был осуществлен запуск космического корабля «Восток-1» с Юрием Гагариным на борту . Перед стартом Гагарин произнес ставшее историческим слово «Поехали!» .",
      value: "Гагарин доказал, что человек может выжить и работать в условиях невесомости и космического полета. Его 108 минут проложили дорогу всем последующим достижениям: выходу в открытый космос (Леонов, 1965), высадке на Луну (1969), созданию орбитальных станций и многомесячным полетам .Несмотря на Холодную войну и разделение мира на два враждующих лагеря, полет Гагарина был воспринят как победа всего человечества. Американские астронавты неоднократно признавали, что именно Гагарин «призвал их в космос» .",
      outcome: "Полет Гагарина нанес серьезное поражение США в соревновании за космическое лидерство. Старт американского астронавта Алана Шепарда был назначен на конец апреля 1961 года, и советские конструкторы во главе с Королевым сознательно форсировали подготовку, чтобы не уступить первенство . Полет Гагарина стал «увесистой пощечиной миру капитала», убедительным доказательством преимущества социалистической системы .После полета Гагарин объехал более 30 стран, его встречали президенты, коронованные особы и сотни тысяч простых людей. Он стал «послом мира», чья улыбка разрушала стереотипы о «хмурых советских людях» .",
      coordinates: { x: 65, y: 34 },
      picture: "Паолёт Гагарина в космос.jpg"
    }
  ],
  "1962": [
    {
      id: 29,
      name: "Карибский кризис",
      year: "1961",
      citate: "«Мы стояли на краю пропасти, глядя друг на друга. Ни у кого не было сетки. Кто дунет первым?» - государственный секретарь США Дина Раска",
      location: "Куба",
      description: "После победы Кубинской революции и провала американского вторжения в заливе Кочинос отношения между США и новой социалистической Кубой резко обострились. Фидель Кастро обратился за военной помощью к Москве.",
      value: "Карибский кризис стал кульминацией Холодной войны. Мир реально оказался на пороге термоядерной катастрофы, способной уничтожить значительную часть планеты. Кеннеди оценивал вероятность войны как «от 1 к 3 до 50 на 50».Кризис продемонстрировал, что дальнейшая гонка вооружений и жёсткое противостояние ведут к взаимному уничтожению. Обе сверхдержавы осознали необходимость контроля над вооружениями. Уже в 1963 году был подписан Договор о запрещении испытаний ядерного оружия в трёх средах. Это стало первым шагом к разрядке международной напряжённости.",
      outcome: "СССР выполнил обязательства, демонтировав и вывезя всё ядерное оружие с острова.К апрелю 1963 года США вывели устаревшие ракеты «Юпитер» из Турции. Этот пункт соглашения оставался секретным в течение многих лет, чтобы не подрывать авторитет НАТО.Чтобы предотвратить подобные кризисы в будущем, была установлена прямая телеграфная линия связи между Белым домом и Кремлём, позволяющая лидерам двух стран оперативно связываться друг с другом в экстренных ситуациях.",
      coordinates: { x: 25, y: 53 },
      picture: "Карибский кризис.jpg"
    }
  ],
  "1969": [
    {
      id: 30,
      name: "Первая высадка человека на Луну",
      year: "1969",
      citate: "«Это один маленький шаг для одного человека, но гигантский скачок для всего человечества» - астронавт Нил Армстронг ",
      location: "Луна",
      description: "16 июля 1969 года ракета Saturn V с экипажем в составе Нила Армстронга, Базза Олдрина и Майкла Коллинза стартовала с мыса Канаверал . 20 июля лунный модуль «Орёл» отделился от командного модуля «Колумбия», где оставался Майкл Коллинз.",
      value: "Высадка на Луну стала моментом триумфа США в разгар Холодной войны. Телевизионную трансляцию первого шага Армстронга посмотрели около 650 миллионов человек по всему миру — на тот момент это стало «самым масштабным событием в истории» по числу зрителей . Для Америки, пережившей убийство Кеннеди, расовые бунты и войну во Вьетнаме, это стало мощным подъёмом национального самосознания .Несмотря на политический контекст, сам факт высадки человека на другом небесном теле воспринимается как достижение не только американцев, но и всего человечества. На памятной табличке, оставленной на Луне, написано: «Здесь люди с планеты Земля впервые ступили на Луну. Июль 1969 года от Рождества Христова. Мы пришли с миром от имени всего человечества» . Советский космонавт Алексей Леонов (первый человек в открытом космосе) неоднократно подтверждал: американцы на Луне были, и факт высадки был подтверждён советскими средствами наблюдения .",
      outcome: "Успех Apollo 11 ознаменовал решающую победу США над СССР в космическом соперничестве, которое началось с запуска советского «Спутника» в 1957 году и полёта Гагарина в 1961 году . Для Советского Союза это было «поражение в лунной гонке», которое его руководство предпочло демонстративно игнорировать .Цель, поставленная президентом Кеннеди в 1962 году («Мы выбираем идти на Луну!»), была достигнута, хотя сам Кеннеди был убит в 1963 году и не дожил до этого момента .Астронавты доставили 382 кг лунного грунта, что позволило учёным сделать фундаментальные выводы о происхождении и геологии Луны. СССР с помощью автоматов смог доставить лишь несколько сотен граммов .",
      coordinates: { x: 20, y: 45 },
      picture: "Первый человек на Луне.jpg"
    }
  ],
  "1979": [
    {
      id: 31,
      name: "Иранская(Исламская) революция",
      year: "1979",
      citate: "«Независимость, свобода, исламская республика!» (перс. «استقلال، آزادی، جمهوری اسلامی» — это девиз Исламской Республики Иран",
      location: "Иран",
      description: "7 января 1978 года была опубликована оскорбительная статья в адрес Хомейни, что вызвало взрыв народного гнева по всей стране . Волнения переросли в массовые забастовки и уличные демонстрации. В них участвовали мужчины и женщины из разных социальных слоёв — базарные торговцы, студенты, духовенство, рабочие. Женщины с детьми на руках выходили на улицы и попадали под прицелы пулемётов .",
      value: "Исламская революция стала первой и пока единственной успешной попыткой в XX веке построить государство, основанное на религиозных принципах, а не на светской идеологии. Это была альтернатива как западной либеральной демократии, так и восточному коммунизму . Лозунг революции — «Ни Восток, ни Запад — только Исламская Республика» .Победа исламистов в Иране вдохновила религиозные и политические движения по всему мусульманскому миру — от Ливана, Палестины и Афганистана. Иран стал позиционировать себя как лидера «мирового ислама» и «оси сопротивления» западному империализму .",
      outcome: "Был разрушен деспотический шахский режим, который просуществовал с 1925 года (династия Пехлеви), но по иранской традиции считается продолжением тысячелетней монархической истории .Конституция 1979 года закрепила исламские принципы как основу политической, социальной и экономической жизни страны. Она гарантирует продолжение Исламской революции как внутри Ирана, так и за его пределами .Революция положила конец политической и экономической зависимости Ирана от США и западных держав, которая установилась после переворота 1953 года.",
      coordinates: { x: 61, y: 45 },
      picture: "Исламская революция.jpg"
    },
    {
      id: 32,
      name: "Афганская война",
      year: "1979",
      citate: "«Примерно 99% сражений и стычек, которые мы вели в Афганистане, были выиграны нашей стороной. Проблема в том, что на следующее утро после боя ситуация возвращается к той же, что была до него» - маршал Сергей Ахромеев ",
      location: "Афганистан",
      description: "27 апреля 1978 года в Афганистане произошла Саурская революция — военный переворот, в результате которого к власти пришла Народно-демократическая партия Афганистана, провозгласившая курс на строительство социализма.",
      value: "Ввод войск в Афганистан положил конец периоду разрядки международной напряжённости, который ознаменовался Хельсинкскими соглашениями 1975 года . Запад расценил действия СССР как агрессию, и Холодная война вступила в новую, острую фазу. США бойкотировали Олимпийские игры 1980 года в Москве, усилили гонку вооружений и активизировали поддержку антисоветских сил по всему миру .Афганскую войну часто называют «кровоточащей раной» для СССР . Многие историки и политологи утверждают, что именно эта война подорвала экономику, дискредитировала советскую армию в глазах общества и в конечном счёте приблизила крах Советского Союза в 1991 году . Как писал один из исследователей, «война определённо ускорила процессы, которые разорвали страну в 1991 году» .",
      outcome: "14 апреля 1988 года в Женеве были подписаны соглашения между Афганистаном и Пакистаном при гарантиях СССР и США. Согласно договорённостям, СССР обязался вывести войска в течение девяти месяцев . 15 февраля 1989 года последняя колонна советских войск под командованием генерала Бориса Громова пересекла границу по мосту Дружбы через Амударью .После вывода советских войск правительство Мохаммада Наджибулы, оставшись без военной поддержки, продержалось всего три года. В апреле 1992 года моджахеды захватили Кабул, и в стране разгорелась новая гражданская война, которая впоследствии привела к приходу к власти движения «Талибан» .",
      coordinates: { x: 65, y: 43 },
      picture: "Афганистан-СССР.jpg"
    }
  ],
  "1991": [
    {
      id: 33,
      name: "Развал СССР",
      year: "1991",
      citate: "«Моя цель — показать читателю, что советская политическая и экономическая система была нестабильной по самой своей природе. Был лишь вопрос времени и того, как именно она рухнет... Мечты о возвращении в другую эпоху иллюзорны. Попытки сделать это приведут к поражению» - один из архитекторов постсоветских экономических реформ, Егор Гайдар",
      location: "СССР - Россия",
      description: "Прекращение существования Союза Советских Социалистических Республик как единого государства, распад на 15 независимых стран.",
      value: "Развал СССР — символический рубеж, завершивший период мировой истории, который начался после Второй мировой войны. Ушла в прошлое Ялтинско-Потсдамская система международных отношений, основанная на разделе мира между державами-победительницами.Биполярное противостояние между СССР и Западом, которое определяло мировую политику с конца 1940-х годов, закончилось. США остались единственной сверхдержавой.На постсоветском пространстве начался сложный процесс национального строительства, сопровождавшийся экономическими трудностями, локальными конфликтами и пересмотром границ. Как отмечал В.В. Путин, «ситуация на Северном Кавказе и в Чечне — это продолжение развала СССР».",
      outcome: "15 новых независимых государств возникли на месте одной из двух сверхдержав, определявших мировой порядок после 1945 года.Последний лидер Советского Союза ушёл с поста президента «уже не существующей страны».Новое объединение, пришедшее на смену СССР, имело гораздо более слабые, координирующие функции, без единого центра власти.",
      coordinates: { x: 57, y: 29 },
      picture: "Развал СССР.jpg"
    },
    {
      id: 34,
      name: "Югославские войны",
      year: "1992-2001",
      citate: "Боже когда я умру, отправь меня в рай, ибо ад я видел на Земле - Надпись в разбомбленном доме в Боснии",
      location: "Сербия",
      description: "После смерти Иосипа Броз Тито в 1980 году центробежные силы в многонациональной Югославии стали нарастать. В 1987 году к власти в Сербии пришёл Слободан Милошевич, который сделал ставку на сербский национализм . 28 июня 1989 года на Косовом поле, в 600-ю годовщину битвы с турками, Милошевич произнёс речь, в которой заявил о возможности вооружённых сражений ради национального возрождения Сербии, что стало сигналом к началу распада страны .",
      value: "Югославские войны стали самым кровопролитным конфликтом на европейском континенте со времён 1945 года . Они продемонстрировали, что даже в конце XX века в центре Европы возможны массовые этнические чистки, геноцид и варварские разрушения городов. Блокада Сараево, длившаяся почти четыре года, стала самой продолжительной осадой города в современной истории .Бомбардировки Югославии силами НАТО без мандата ООН стали переломным моментом в развитии международного права. Был поставлен вопрос о легитимности «гуманитарной интервенции» — концепции, которая позволяет вмешиваться во внутренние дела государств под предлогом защиты прав человека. Западные страны активно продвигали эту концепцию, в то время как Россия и Китай выступили против. Этот расклад во многом определил дебаты о границах международного права в 2000-е годы.",
      outcome: "Страна, существовавшая с 1918 года (под разными названиями), прекратила своё существование. На её месте образовалось несколько независимых государств: Словения, Хорватия, Босния и Герцеговина, Северная Македония, Союзная Республика Югославия (позже Сербия и Черногория, разделившиеся в 2006 году), а также частично признанное Косово .В результате войны 1999 года и бомбардировок НАТО Югославия была вынуждена вывести свои войска из Косово и Метохии. Край перешёл под контроль сил НАТО и албанских сепаратистов . В 2008 году Косово в одностороннем порядке провозгласило независимость, которая была признана странами Запада, но не признана Сербией и Россией.Общее число погибших в ходе югославских войн оценивается от 130 до 160 тысяч человек . От 2,5 до 3 миллионов человек стали беженцами или были перемещены . Экономике региона был нанесён колоссальный ущерб.",
      coordinates: { x: 53, y: 37 },
      picture: "Югославские войны.jpg"
    }
  ],
  "1994": [
    {
      id: 35,
      name: "Первая Чеченская война",
      year: "1994-1996",
      citate: "«Ничего себе армия победителей Гитлера! А не хотите — армия учеников? Ничего себе защитили детей и внуков от нацизма! Стоило ли защищать, чтоб потом эти внуки, поднабравшись у тех, с кем этот дед воевал, жгли напалмом и дедов, и младенцев, и матерей по-го-лов-но?» - писатель Михаил Сухотин",
      location: "Чечня",
      description: "После распада Советского Союза в 1991 году многие республики, включая Чечено-Ингушскую АССР, столкнулись с вопросом о своей дальнейшей судьбе. В сентябре 1991 года, воспользовавшись политическим хаосом в Москве (августовский путч ГКЧП), чеченские сепаратисты под руководством бывшего советского генерала Джохара Дудаева разогнали Верховный совет республики и провозгласили создание независимой Чеченской Республики Ичкерия.",
      value: "Планировавшаяся как быстрая полицейская операция, Первая чеченская война превратилась в затяжной кровавый конфликт, в котором российская армия — наследница победителей нацизма — оказалась неготовой к современной городской партизанской войне. Солдаты-срочники, не имевшие подготовки, гибли сотнями из-за тактических ошибок командования и устаревшего вооружения. Это был шок для общества, выросшего на мифах о непобедимости Советской армии.Если в начале 1990-х годов движение Дудаева было преимущественно светским и националистическим, то поражение России и последовавший хаос создали питательную среду для радикальных исламистских групп. В Чечню хлынули наёмники и проповедники из арабских стран, которые постепенно взяли верх над светскими лидерами. Это напрямую подготовило почву для Второй чеченской войны (1999 г.) и распространения терроризма на всю Россию.",
      outcome: "Грозный и другие города (Аргун, Гудермес, Шали) были превращены в руины в результате бомбардировок и артиллерийских обстрелов. Это были самые интенсивные бомбардировки в Европе со времён Второй мировой войны.Сотни тысяч чеченцев стали беженцами, покинув республику. Республика погрузилась в хаос, криминал и фактическую анархию.Поражение в Чечне нанесло сокрушительный удар по рейтингу Бориса Ельцина и его правительства. Война стала одной из причин падения его популярности и прихода к власти Владимира Путина в 1999 году, который обещал навести порядок на Кавказе.",
      coordinates: { x: 59, y: 39 },
      picture: "Первая Чеченская война.jpg"
    }
  ],
  "1999": [
    {
      id: 36,
      name: "Вторая Чеченская война",
      year: "1999",
      citate: "«Мама, я в Чечне. Всё нормально. Скогда буду.» — Стандартное содержание писем многих солдат.",
      location: "Чечня",
      description: "Вторая чеченская война стала прямым следствием неурегулированного конфликта после Первой чеченской войны, когда Россия фактически потеряла контроль над территорией Чечни . В межвоенный период (1996–1999 гг.) республика превратилась в «чёрную дыру»: там процветали похищения людей, работорговля, наркотрафик, а также активно распространялись идеи ваххабизма и экстремизма.",
      value: "Вторая чеченская война стала катализатором перестройки российского государства. Именно в ходе этой войны власть пересмотрела общественный договор: население согласилось на ограничение свобод и укрепление вертикали власти в обмен на обещание стабильности и безопасности . Как отмечают политологи, Чечня убедила Путина и его окружение в том, что война может решать политические проблемы .Вторая чеченская война создала опасный прецедент: внутренняя политическая проблема решалась военной силой. Этот опыт затем применялся в других формах — от «закручивания гаек» внутри страны до подавления любых форм протеста и инакомыслия .Хотя война официально закончилась в 2009 году, террористическое подполье переместилось в соседние республики — Дагестан, Ингушетию, Кабардино-Балкарию, Карачаево-Черкесию . «Кавказский фронт», созданный полевыми командирами, стал результатом войны, а не её завершением .",
      outcome: "Российская армия вернула себе полный контроль над территорией республики, непризнанная Чеченская Республика Ичкерия прекратила своё существование . Грозный, лежавший в руинах после штурма 1999–2000 годов, был отстроен заново.В 2004 году в результате теракта погиб его отец Ахмат Кадыров — бывший муфтий Ичкерии, перешедший на сторону России. Рамзан Кадыров стал сначала премьер-министром, а затем президентом Чечни . Сегодня он управляет республикой как фактически автономным образованием, где его личная власть часто оказывается сильнее федеральных законов .Война сделала Путина популярным политиком. В сентябре 1999 года его рейтинг составлял около 2%, а к моменту избрания президентом в 2000 году превысил 50% . Обещание «мочить в сортире» террористов стало его политической визитной карточкой .",
      coordinates: { x: 59, y: 39 },
      picture: "Вторая Чеченская война.jpg"
    }
  ],
  "2001": [
    {
      id: 37,
      name: "Теракт 11 сентября",
      year: "2001",
      citate: "«Сегодня вечером я могу доложить американскому народу и всему миру, что Соединенные Штаты провели операцию, в ходе которой был убит Усама бен Ладен, лидер Аль-Каиды и террорист, ответственный за убийство тысяч невинных мужчин, женщин и детей... Почти 3000 граждан были отняты у нас, оставив зияющую дыру в наших сердцах. Справедливость свершилась» - Заявление президента Барака Обамы 2 мая 2011 года, об уничтожении бен Ладена",
      location: "США",
      description: "Утром 11 сентября 2001 года 19 террористов, которой руководил Усама бен Ладен, захватили четыре пассажирских авиалайнера. Два самолета были направлены на башни Всемирного торгового центра в Нью-Йорке — символ американского экономического могущества. Оба небоскреба, охваченные пожаром, рухнули в течение двух часов, уничтожив также несколько соседних зданий .",
      value: "Теракты 11 сентября разрушили ощущение безопасности, которое Соединенные Штаты испытывали на протяжении десятилетий. Как отметила бывший министр внутренней безопасности США Джанет Наполитано: «Даже после Перл-Харбора сохранялась презумпция, что мы каким-то образом невосприимчивы к атакам, что наши авиалайнеры не будут превращены в оружие и направлены в символические здания. Эта презумпция была эффективно уничтожена 11 сентября — и она не вернулась» .Именно 11 сентября 2001 года определило терроризм как основную угрозу международной безопасности начала XXI века. По словам экспертов, «те акты массовых убийств были призваны привести нашу нацию в хаос и отступление. Но у них ничего не получилось... Террористические атаки могут поколебать фундаменты наших зданий, но они не могут затронуть основы Америки» .В 2002 году 25% американцев считали, что ислам с большей вероятностью поощряет насилие, чем другие религии. К 2021 году доля американцев, разделяющих это мнение, удвоилась до 50% — при резком партийном расколе (72% республиканцев против 32% демократов) . Миллионы мусульман по всему миру столкнулись с беспрецедентным уровнем подозрительности и дискриминации. Как отмечает эксперт Гарвардского университета Фарах Пандит: «Нападения поставили под микроскоп одну единственную религию и усилили настроения, с которыми мусульмане продолжают сталкиваться повсеместно» .",
      outcome: "Президент Джордж Буш-младший уже 11 сентября объявил: «Свобода была атакована сегодня утром безликим трусом, и свобода будет защищена. Не сомневайтесь: Соединенные Штаты выследят и накажут тех, кто несет ответственность за эти трусливые акты» .В 2002 году было создано Министерство внутренней безопасности США (Department of Homeland Security), объединившее 22 федеральных агентства. Был принят «Патриотический акт» (USA PATRIOT Act), значительно расширивший полномочия спецслужб по слежке за гражданами . Создана Администрация транспортной безопасности (TSA), введены новые стандарты досмотра в аэропортах по всему миру .Нью-Йоркская фондовая биржа не открылась 11 сентября и оставалась закрытой до 17 сентября. Индекс Dow Jones упал более чем на 7 процентов в первый день торгов — рекордное однодневное падение на тот момент. Прямые и косвенные расходы США, связанные с атаками, превысили 5 триллионов долларов .",
      coordinates: { x: 26, y: 40 },
      picture: "9 Сентября.jpg"
    },
    {
      id: 38,
      name: "Война в Афганистане",
      year: "2001",
      citate: "«Война — это долгие периоды скуки, прерываемые мгновениями чистого ужаса». - Надпсь на могиле солдата",
      location: "Афганистан",
      description: "Война в Афганистане стала прямым ответом США на террористические атаки 11 сентября 2001 года, в результате которых погибли почти 3 тысячи человек . Правивший тогда Афганистаном режим талибов отказался выдать лидера «Аль-Каиды» Усаму бен Ладена. 7 октября 2001 года США при поддержке союзников начали военную операцию .",
      value: "Глава Объединённого комитета начальников штабов США генерал Марк Милли назвал итог войны «логистическим успехом, но стратегическим провалом» . Афганистан стал символом краха американской концепции экспорта демократии военным путём. Эта война, наряду с войной во Вьетнаме, вошла в историю как одно из самых унизительных поражений сверхдержавы .Долгое время после окончания Холодной войны в США доминировала идея, что американская военная сила может не только побеждать врагов, но и перестраивать целые общества, делая их демократическими и мирными. Афганистан (как и Ирак) доказал иллюзорность этих надежд. Как пишет Foreign Affairs, изначальная победа была «быстрой и ошеломляющей», но стремление к тотальной победе без компромиссов «посадило семена будущего восстания талибов» .",
      outcome: "Война, начавшаяся со свержения режима талибов, закончилась их триумфальным возвращением. Именно то правительство, которое США свергли в 2001 году, вновь контролирует Афганистан .По разным оценкам, жертвами войны стали более 30 тысяч мирных жителей Афганистана, более 60 тысяч были ранены, а около 11 миллионов афганцев стали беженцами . 72% афганцев живут за чертой бедности, 38% — уровень безработицы .Вопреки первоначальной цели, количество террористических группировок в Афганистане за годы войны выросло с одной до более чем двадцати . Если в 2001 году в стране было совершено 20 терактов, то в 2020 году — уже более двух тысяч .",
      coordinates: { x: 65, y: 43 },
      picture: "Афганистан-США.jpg"
    }
  ],
  "2004": [
    {
      id: 39,
      name: "Теракт в Беслане",
      year: "2004",
      citate: "«Мы не знали, что такое ад, пока не оказались в том спортивном зале.» - одна из заложниц",
      location: "Россия",
      description: "Утром 1 сентября 2004 года — в День знаний — группа вооружённых боевиков под командованием террориста Руслана Хучбарова прорвалась на территорию школы № 1 в Беслане . В это время на школьном дворе проходила торжественная линейка с участием детей, родителей и учителей.Террористы захватили в заложники более 1100 человек (по некоторым данным — до 1200), большинство из которых составляли дети, а также их родители и педагоги .",
      value: "По числу жертв, в особенности детей, Беслан стал самой кровавой трагедией в постсоветской истории России и одним из самых страшных терактов в мире .Беслан продемонстрировал фатальные недостатки в координации силовых структур и антикризисном управлении. После теракта была создана новая система безопасности на Северном Кавказе, усилены полномочия спецслужб, а также введён запрет на освещение контртеррористических операций в СМИ, который действует до сих пор . Несмотря на шок и горе, Беслан также стал точкой отсчёта для беспрецедентного в России гражданского сопротивления. Родственники жертв — «Матери Беслана» — организовались в ассоциацию и, несмотря на давление властей, долгие годы добивались правды и справедливости. Как отмечает исследователь Дебра Джавелин, теракт «спровоцировал беспрецедентную мирную политическую активность в масштабах, которых не видели больше нигде в России» .",
      outcome: "В результате теракта погиб 331 или 334 человека. Здание школы № 1 было практически полностью разрушено в ходе боевых действий. Позже часть его стен была оставлена в руинах в качестве мемориала, а рядом построено новое здание . В 2025 году на территории школы открыли первую очередь интерактивного музея, посвящённого терактам в России .",
      coordinates: { x: 59, y: 39 },
      picture: "Терракт в БЕслане.jpg"
    }
  ],
  "2003": [
    {
      id: 40,
      name: "Война в Ираке",
      year: "2003-2011",
      citate: "«Мы пришли сюда бороться с армией, а вместо этого попали в гражданскую войну.» - солдаты США во время операции в Ираке",
      location: "Ирак",
      description: "Иракская война стала кульминацией многолетнего противостояния между США и режимом Саддама Хусейна, которое не прекращалось после войны в Персидском заливе 1991 года. На протяжении 1990-х годов Ирак периодически конфликтовал с международными инспекторами ООН, которые следили за ликвидацией иракского оружия массового поражения.",
      value: "Британская газета Financial Times назвала войну в Ираке «крупнейшей дипломатической ошибкой периода после Второй мировой войны» . Авантюра администрации Буша, основанная на сфальсифицированных разведданных, подорвала доверие к США как к лидеру «свободного мира». Опрос 2011 года показал, что 68% американцев выступали против войны, а половина опрошенных заявили, что отстранение Хусейна не стоило потраченных жизней и ресурсов .Вторжение в Ирак в обход Совета Безопасности ООН продемонстрировало готовность США действовать в одностороннем порядке, когда это выгодно. Это вызвало глубокий раскол в международных отношениях: Франция, Германия, Китай и Россия категорически выступили против войны, в то время как Великобритания и ряд других стран поддержали США . Трансатлантические отношения получили серьёзную трещину.",
      outcome: "Диктатор, правивший Ираком 24 года, был отстранён от власти, арестован и казнён. Партия «Баас» запрещена, армия распущена .Вместо «демократического маяка» на Ближнем Востоке Ирак погрузился в пучину межконфессионального насилия (шииты против суннитов), стал ареной для террористических группировок и полем битвы за влияние между Ираном и Саудовской Аравией . К 2011 году Ирак занял 9-е место в рейтинге «несостоявшихся государств» журнала Foreign Policy .Одним из самых парадоксальных итогов войны стало резкое усиление главного регионального противника США — Ирана. Шиитское большинство, пришедшее к власти в Ираке после падения суннитского режима Хусейна, оказалось гораздо ближе к Тегерану, чем к Вашингтону. Иран получил возможность беспрепятственно влиять на политику в центре арабского мира .",
      coordinates: { x: 59, y: 45 },
      picture: "Ирак.jpg"
    }
  ],
  "2006": [
    {
      id: 40,
      name: "Рождение Артёма Погудина",
      year: "2006",
      citate: "«Иногда я думаю зачем он меня познакомил с таким *****(замечательным человеком как ты), я реально пошел гуглить хотя знал что ты врёшь» - Один из приблежжых Артёма Погудина",
      location: "Россия, Воткинск",
      description: "10 октября 2006 родилась легенда, не существует таких слов чтобы описать его гениальность и скромность.",
      value: "После этого вся история человечества изменилась на до и после.",
      outcome: "С момента рождения Артёма, история человечества пошла в противоположное русло.",
      coordinates: { x: 59, y: 30 },
      picture: "Артём.jpg"
    }
  ]
};

function createEventButtons(year) {
  const container = document.querySelector('.map-container');
  const events = eventsData[year] || [];

  document.querySelectorAll('.event-button').forEach(btn => btn.remove());

  events.forEach(event => {
    const button = document.createElement('div');
    button.className = 'event-button';
    button.textContent = ' ';
    button.style.left = `${event.coordinates.x}%`;
    button.style.top = `${event.coordinates.y}%`;
    button.dataset.eventId = event.id;
    button.addEventListener('click', () => showEventDetails(event));
    container.appendChild(button);
  });
}

function showEventDetails(event) {
  const modal = document.querySelector('.modal-overlay');
  const detailsContainer = document.getElementById('event-details');

  if (!event) return;

  detailsContainer.innerHTML = `
    <h2>${event.name}</h2>
    <div class="event-layout">
      <div class="event-description-block">
        <div class="event-center-block">
          <div class="event-image">
            <img class="event-image-img" src="${event.picture || ''}" alt="${event.name}">
          </div>
          <div class="event-citate">${event.citate}</div>
        </div>
        <div>
          <div class="event-location">${event.location}</div>
          <div class="event-description">${event.description}</div>
        </div>
      </div>

      <div class="event-section">
        <h3>Детали</h3>
        <ul>
          <li><strong>Значение:</strong> ${event.value}</li>
          <li><strong>Итог:</strong> ${event.outcome}</li>
        </ul>
      </div>
    </div>
  `;

  modal.classList.add('active');
}

function closeModal() {
  document.querySelector('.modal-overlay').classList.remove('active');
}

document.addEventListener('DOMContentLoaded', function () {
  const yearSelect = document.getElementById('year-select');

  yearSelect.addEventListener('change', function () {
    createEventButtons(this.value);
  });

  document.querySelector('.close-modal').addEventListener('click', closeModal);

  document.querySelector('.modal-overlay').addEventListener('click', function (e) {
    if (e.target === this) closeModal();
  });

  createEventButtons(yearSelect.value);
});
